eisup_2019_docmng_integration/src/Documents/абс_ВводПланаПриБюджетированииСверхуВниз/абс_ВводПланаПриБюджетированииСверхуВниз.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>абс_ВводПланаПриБюджетированииСверхуВниз</name>
  <registerRecords>InformationRegister.абс_УстановкаЛимитовПоСтатьям</registerRecords>
  <registerRecords>AccumulationRegister.ОборотыБюджетов</registerRecords>
  <registerRecords>AccumulationRegister.КонтролируемыеЗначенияБюджетов</registerRecords>
  <registerRecords>InformationRegister.УстановкаОграниченийПоБюджетам</registerRecords>
  <attributes>
    <name>Сценарий</name>
    <type>
      <types>CatalogRef.СценарииПланирования</types>
    </type>
  </attributes>
  <attributes>
    <name>Год</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументСторно</name>
    <type>
      <types>DocumentRef.абс_ВводПланаПриБюджетированииСверхуВниз</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеБюджета</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СписокРедактируемыхАналитик</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ВводТолькоПлана</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.абс_СтатусыБюджетов</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Бюджет</name>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦФУ</name>
      <type>
        <types>CatalogRef.абс_ЦФУ</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦФО</name>
      <type>
        <types>CatalogRef.Подразделения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипРасходаНаПроизводствоИРеализацию</name>
      <type>
        <types>CatalogRef.абс_ТипыРасходовНаПроизводствоИРеализацию</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипКонтрагента</name>
      <type>
        <types>CatalogRef.абс_ТипыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипСети</name>
      <type>
        <types>CatalogRef.абс_ТипыСетей</types>
      </type>
    </attributes>
    <attributes>
      <name>КВ</name>
      <type>
        <types>CatalogRef.абс_КапитальныеВложения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТЭО</name>
      <type>
        <types>CatalogRef.абс_ТЭО</types>
      </type>
    </attributes>
    <attributes>
      <name>БюджетнаяСтатья</name>
      <type>
        <types>CatalogRef.СтатьиОборотовПоБюджетам</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаРуб</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Валюта</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаВал</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаЛимитаРуб</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Период</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаЛимитаВал</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Проект</name>
      <type>
        <types>CatalogRef.Проекты</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

eisup_2019_docmng_integration/src/Documents/абс_ВводПланаПриБюджетированииСверхуВниз/Forms/ФормаДокументаУправляемая/Module.bsl
&НаСервере
Процедура ПрочитатьТЧБюджетСервер()
	
	ТЧ_Бюджет.Очистить();
	
	Для Каждого СтрокаБюджета Из Объект.Бюджет Цикл
		
		ИндексКолонки = Прав("0" + Месяц(СтрокаБюджета.Период), 2);
		
		СтруктураАналитик = ПолучитьСтруктуруАналитик(СтрокаБюджета);
		
		СтрокиТЧБюджет = ТЧ_Бюджет.НайтиСтроки(СтруктураАналитик);
		
		Если СтрокиТЧБюджет.Количество() = 0 Тогда
			СтрокаТЧБюджет = ТЧ_Бюджет.Добавить();
			
			ЗаполнитьЗначенияСвойств(СтрокаТЧБюджет, СтруктураАналитик);
		Иначе
			СтрокаТЧБюджет = СтрокиТЧБюджет[0];
		КонецЕсли;
		
		СтрокаТЧБюджет["СуммаРуб" + ИндексКолонки] = СтрокаБюджета.СуммаРуб;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура СохранитьТЧБюджетСервер()
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСтруктуруАналитик(СтрокаБюджета)
	
	СтруктураАналитик = Новый Структура;
	
	СтруктураАналитик.Вставить("Организация"			, СтрокаБюджета.Организация);
	СтруктураАналитик.Вставить("ЦФУ"					, СтрокаБюджета.ЦФУ);
	СтруктураАналитик.Вставить("ЦФО"					, СтрокаБюджета.ЦФО);
	СтруктураАналитик.Вставить("ТипРасхода"				, СтрокаБюджета.ТипРасходаНаПроизводствоИРеализацию);
	СтруктураАналитик.Вставить("ТипКонтрагента"			, СтрокаБюджета.ТипКонтрагента);
	СтруктураАналитик.Вставить("ТипСети"				, СтрокаБюджета.ТипСети);
	СтруктураАналитик.Вставить("КВ"						, СтрокаБюджета.КВ);
	СтруктураАналитик.Вставить("ТЭО"					, СтрокаБюджета.ТЭО);
	СтруктураАналитик.Вставить("БюджетнаяСтатья"		, СтрокаБюджета.БюджетнаяСтатья);
	
	СтруктураАналитик.Вставить("Валюта"					, СтрокаБюджета.Валюта);
	
	Возврат СтруктураАналитик;
	
КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПрочитатьТЧБюджетСервер();
	
КонецПроцедуры
